{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(69, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(69, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(69, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[13, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "64", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[25, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attr": {
        "kernel": "(1, 3)", 
        "pad": "(0, 1)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "128", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "128", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "128", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[38, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "128", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "128", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "128", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[50, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(1, 3)", 
        "pad": "(0, 1)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "256", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "256", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "256", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 1], [61, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[63, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "256", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution11_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "256", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "256", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[75, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attr": {
        "kernel": "(1, 3)", 
        "pad": "(0, 1)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "512", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "512", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "512", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "512", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "512", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[88, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "512", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution15_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "512", 
        "pad": "(0, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "512", 
        "pad": "(0, 1)"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 1], [98, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "512", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "512", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[100, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attr": {
        "kernel": "(1, 8)", 
        "pad": "(0, 1)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmaxoutput0_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput0", 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    8, 
    9, 
    10, 
    11, 
    14, 
    17, 
    18, 
    20, 
    21, 
    22, 
    23, 
    26, 
    30, 
    31, 
    33, 
    34, 
    35, 
    36, 
    39, 
    42, 
    43, 
    45, 
    46, 
    47, 
    48, 
    51, 
    55, 
    56, 
    58, 
    59, 
    60, 
    61, 
    64, 
    67, 
    68, 
    70, 
    71, 
    72, 
    73, 
    76, 
    80, 
    81, 
    83, 
    84, 
    85, 
    86, 
    89, 
    92, 
    93, 
    95, 
    96, 
    97, 
    98, 
    101, 
    106, 
    107, 
    109
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127
  ], 
  "heads": [[110, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}